// Написать программу для вывода «Hello World» на консоль
public class Main
{
    public static void main(String[] args)
    {
        System.out.println("Hello World");
    }
}